# DockablePane Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockablePane Constructor
DockablePane Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockablePane(DockablePane) | Constructs a new copy of the input DockablePane object. |
| DockablePane(DockablePaneId) | Gets the pane with identifier %id%. |

# See Also
DockablePane Class
DockablePane Members
Autodesk.Revit.UI Namespace